bantamtools/g2_chabo_public/src/packs/ATSAMS70N20B_DFP/component/hsmci.h
#define HSMCI_FIFO141_REG_OFST         (0x434)             /**< (HSMCI_FIFO141) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO142_REG_OFST         (0x438)             /**< (HSMCI_FIFO142) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO143_REG_OFST         (0x43C)             /**< (HSMCI_FIFO143) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO144_REG_OFST         (0x440)             /**< (HSMCI_FIFO144) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO145_REG_OFST         (0x444)             /**< (HSMCI_FIFO145) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO146_REG_OFST         (0x448)             /**< (HSMCI_FIFO146) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO147_REG_OFST         (0x44C)             /**< (HSMCI_FIFO147) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO148_REG_OFST         (0x450)             /**< (HSMCI_FIFO148) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO149_REG_OFST         (0x454)             /**< (HSMCI_FIFO149) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO150_REG_OFST         (0x458)             /**< (HSMCI_FIFO150) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO151_REG_OFST         (0x45C)             /**< (HSMCI_FIFO151) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO152_REG_OFST         (0x460)             /**< (HSMCI_FIFO152) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO153_REG_OFST         (0x464)             /**< (HSMCI_FIFO153) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO154_REG_OFST         (0x468)             /**< (HSMCI_FIFO154) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO155_REG_OFST         (0x46C)             /**< (HSMCI_FIFO155) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO156_REG_OFST         (0x470)             /**< (HSMCI_FIFO156) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO157_REG_OFST         (0x474)             /**< (HSMCI_FIFO157) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO158_REG_OFST         (0x478)             /**< (HSMCI_FIFO158) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO159_REG_OFST         (0x47C)             /**< (HSMCI_FIFO159) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO160_REG_OFST         (0x480)             /**< (HSMCI_FIFO160) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO161_REG_OFST         (0x484)             /**< (HSMCI_FIFO161) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO162_REG_OFST         (0x488)             /**< (HSMCI_FIFO162) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO163_REG_OFST         (0x48C)             /**< (HSMCI_FIFO163) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO164_REG_OFST         (0x490)             /**< (HSMCI_FIFO164) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO165_REG_OFST         (0x494)             /**< (HSMCI_FIFO165) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO166_REG_OFST         (0x498)             /**< (HSMCI_FIFO166) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO167_REG_OFST         (0x49C)             /**< (HSMCI_FIFO167) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO168_REG_OFST         (0x4A0)             /**< (HSMCI_FIFO168) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO169_REG_OFST         (0x4A4)             /**< (HSMCI_FIFO169) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO170_REG_OFST         (0x4A8)             /**< (HSMCI_FIFO170) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO171_REG_OFST         (0x4AC)             /**< (HSMCI_FIFO171) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO172_REG_OFST         (0x4B0)             /**< (HSMCI_FIFO172) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO173_REG_OFST         (0x4B4)             /**< (HSMCI_FIFO173) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO174_REG_OFST         (0x4B8)             /**< (HSMCI_FIFO174) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO175_REG_OFST         (0x4BC)             /**< (HSMCI_FIFO175) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO176_REG_OFST         (0x4C0)             /**< (HSMCI_FIFO176) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO177_REG_OFST         (0x4C4)             /**< (HSMCI_FIFO177) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO178_REG_OFST         (0x4C8)             /**< (HSMCI_FIFO178) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO179_REG_OFST         (0x4CC)             /**< (HSMCI_FIFO179) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO180_REG_OFST         (0x4D0)             /**< (HSMCI_FIFO180) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO181_REG_OFST         (0x4D4)             /**< (HSMCI_FIFO181) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO182_REG_OFST         (0x4D8)             /**< (HSMCI_FIFO182) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO183_REG_OFST         (0x4DC)             /**< (HSMCI_FIFO183) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO184_REG_OFST         (0x4E0)             /**< (HSMCI_FIFO184) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO185_REG_OFST         (0x4E4)             /**< (HSMCI_FIFO185) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO186_REG_OFST         (0x4E8)             /**< (HSMCI_FIFO186) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO187_REG_OFST         (0x4EC)             /**< (HSMCI_FIFO187) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO188_REG_OFST         (0x4F0)             /**< (HSMCI_FIFO188) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO189_REG_OFST         (0x4F4)             /**< (HSMCI_FIFO189) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO190_REG_OFST         (0x4F8)             /**< (HSMCI_FIFO190) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO191_REG_OFST         (0x4FC)             /**< (HSMCI_FIFO191) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO192_REG_OFST         (0x500)             /**< (HSMCI_FIFO192) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO193_REG_OFST         (0x504)             /**< (HSMCI_FIFO193) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO194_REG_OFST         (0x508)             /**< (HSMCI_FIFO194) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO195_REG_OFST         (0x50C)             /**< (HSMCI_FIFO195) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO196_REG_OFST         (0x510)             /**< (HSMCI_FIFO196) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO197_REG_OFST         (0x514)             /**< (HSMCI_FIFO197) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO198_REG_OFST         (0x518)             /**< (HSMCI_FIFO198) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO199_REG_OFST         (0x51C)             /**< (HSMCI_FIFO199) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO200_REG_OFST         (0x520)             /**< (HSMCI_FIFO200) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO201_REG_OFST         (0x524)             /**< (HSMCI_FIFO201) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO202_REG_OFST         (0x528)             /**< (HSMCI_FIFO202) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO203_REG_OFST         (0x52C)             /**< (HSMCI_FIFO203) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO204_REG_OFST         (0x530)             /**< (HSMCI_FIFO204) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO205_REG_OFST         (0x534)             /**< (HSMCI_FIFO205) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO206_REG_OFST         (0x538)             /**< (HSMCI_FIFO206) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO207_REG_OFST         (0x53C)             /**< (HSMCI_FIFO207) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO208_REG_OFST         (0x540)             /**< (HSMCI_FIFO208) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO209_REG_OFST         (0x544)             /**< (HSMCI_FIFO209) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO210_REG_OFST         (0x548)             /**< (HSMCI_FIFO210) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO211_REG_OFST         (0x54C)             /**< (HSMCI_FIFO211) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO212_REG_OFST         (0x550)             /**< (HSMCI_FIFO212) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO213_REG_OFST         (0x554)             /**< (HSMCI_FIFO213) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO214_REG_OFST         (0x558)             /**< (HSMCI_FIFO214) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO215_REG_OFST         (0x55C)             /**< (HSMCI_FIFO215) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO216_REG_OFST         (0x560)             /**< (HSMCI_FIFO216) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO217_REG_OFST         (0x564)             /**< (HSMCI_FIFO217) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO218_REG_OFST         (0x568)             /**< (HSMCI_FIFO218) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO219_REG_OFST         (0x56C)             /**< (HSMCI_FIFO219) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO220_REG_OFST         (0x570)             /**< (HSMCI_FIFO220) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO221_REG_OFST         (0x574)             /**< (HSMCI_FIFO221) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO222_REG_OFST         (0x578)             /**< (HSMCI_FIFO222) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO223_REG_OFST         (0x57C)             /**< (HSMCI_FIFO223) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO224_REG_OFST         (0x580)             /**< (HSMCI_FIFO224) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO225_REG_OFST         (0x584)             /**< (HSMCI_FIFO225) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO226_REG_OFST         (0x588)             /**< (HSMCI_FIFO226) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO227_REG_OFST         (0x58C)             /**< (HSMCI_FIFO227) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO228_REG_OFST         (0x590)             /**< (HSMCI_FIFO228) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO229_REG_OFST         (0x594)             /**< (HSMCI_FIFO229) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO230_REG_OFST         (0x598)             /**< (HSMCI_FIFO230) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO231_REG_OFST         (0x59C)             /**< (HSMCI_FIFO231) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO232_REG_OFST         (0x5A0)             /**< (HSMCI_FIFO232) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO233_REG_OFST         (0x5A4)             /**< (HSMCI_FIFO233) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO234_REG_OFST         (0x5A8)             /**< (HSMCI_FIFO234) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO235_REG_OFST         (0x5AC)             /**< (HSMCI_FIFO235) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO236_REG_OFST         (0x5B0)             /**< (HSMCI_FIFO236) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO237_REG_OFST         (0x5B4)             /**< (HSMCI_FIFO237) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO238_REG_OFST         (0x5B8)             /**< (HSMCI_FIFO238) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO239_REG_OFST         (0x5BC)             /**< (HSMCI_FIFO239) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO240_REG_OFST         (0x5C0)             /**< (HSMCI_FIFO240) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO241_REG_OFST         (0x5C4)             /**< (HSMCI_FIFO241) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO242_REG_OFST         (0x5C8)             /**< (HSMCI_FIFO242) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO243_REG_OFST         (0x5CC)             /**< (HSMCI_FIFO243) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO244_REG_OFST         (0x5D0)             /**< (HSMCI_FIFO244) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO245_REG_OFST         (0x5D4)             /**< (HSMCI_FIFO245) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO246_REG_OFST         (0x5D8)             /**< (HSMCI_FIFO246) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO247_REG_OFST         (0x5DC)             /**< (HSMCI_FIFO247) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO248_REG_OFST         (0x5E0)             /**< (HSMCI_FIFO248) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO249_REG_OFST         (0x5E4)             /**< (HSMCI_FIFO249) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO250_REG_OFST         (0x5E8)             /**< (HSMCI_FIFO250) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO251_REG_OFST         (0x5EC)             /**< (HSMCI_FIFO251) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO252_REG_OFST         (0x5F0)             /**< (HSMCI_FIFO252) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO253_REG_OFST         (0x5F4)             /**< (HSMCI_FIFO253) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO254_REG_OFST         (0x5F8)             /**< (HSMCI_FIFO254) FIFO Memory Aperture0 0 Offset */
#define HSMCI_FIFO255_REG_OFST         (0x5FC)             /**< (HSMCI_FIFO255) FIFO Memory Aperture0 0 Offset */

